# RevisionsOnSheetUIServiceData Members

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
RevisionsOnSheetUIServiceData Members
RevisionsOnSheetUIServiceData Class Methods Properties See Also
---
The RevisionsOnSheetUIServiceData type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose | Releases all resources used by the RevisionsOnSheetUIServiceData |
| Equals | Determines whether the specified Object is equal to the current Object. (Inherited from Object.) |
| GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
| GetParentHwnd | return the parent handle |
| GetRevitElementIds | return the list of revit Element Ids |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| ToString | Returns a string that represents the current object. (Inherited from Object.) |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Document | return the document |
| IsReset | flag to indicate the value has been reset |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
| ParamId | the parameter id |

# See Also
RevisionsOnSheetUIServiceData Class
Autodesk.Revit.UI Namespace